# APAN 5310 Term Project - Group 11

## Normalization Process

### Import packages

In [1]:
#!pip install -U "psycopg[binary]"

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

### Read and nodify the orginal csv files

In [3]:
# read in the csv files
df = pd.read_csv('groceries.csv')
df1 = pd.read_csv('employees.csv')

In [4]:
# duplicates
len(df[['first_name','last_name']].drop_duplicates())
len(df1[['id']].drop_duplicates())

100

In [5]:
# rename columns in the orginal csv file to advoid confusion
df1=df1.rename(columns={'id':'employee_id','Role':'role','store_number':'store_id','phone':'contact_info'})
df=df.rename(columns={'store_number':'store_id','store_street':'store_address','store_phone_number':'phone_number'})

### Connect

In [6]:
# connect to Pgadmine
conn_url = 'postgresql://postgres:123@localhost:5432/apan5310termproject'
engine = create_engine(conn_url)
connection = engine.connect()

In [7]:
# #Run for test only - drop all the tables and start over

# drop_tables_queries = [
#     'DROP TABLE IF EXISTS transactions;',
#     'DROP TABLE IF EXISTS accounting;',
#     'DROP TABLE IF EXISTS promotions;',
#     'DROP TABLE IF EXISTS employee_shifts;',
#     'DROP TABLE IF EXISTS vendor_Contracts;',
#     'DROP TABLE IF EXISTS order_items;',
#     'DROP TABLE IF EXISTS customer_orders;',
#     'DROP TABLE IF EXISTS sales;',
#     'DROP TABLE IF EXISTS customers;',
#     'DROP TABLE IF EXISTS deliveries;',
#     'DROP TABLE IF EXISTS inventory;',
#     'DROP TABLE IF EXISTS suppliers;',
#     'DROP TABLE IF EXISTS product_categories;',
#     'DROP TABLE IF EXISTS stores;',
#     'DROP TABLE IF EXISTS employees;'
# ]
# with engine.begin() as connection:
#     for query in drop_tables_queries:
#         connection.execute(text(query))

In [8]:
# SQL query to create all the 15 tables

stmt = """
CREATE TABLE employees(
employee_id serial,
first_name varchar(30) NOT NULL,
last_name varchar(30) NOT NULL,
role varchar(50) NOT NULL,
hire_date date NOT NULL,
store_id int,
contact_info varchar(200),
PRIMARY KEY(employee_id)
);

CREATE TABLE stores(
store_id serial,
store_address varchar(200) NOT NULL,
phone_number varchar(20),
manager_id int,
PRIMARY KEY(store_id),
FOREIGN KEY(manager_id) REFERENCES employees(employee_id)
);

CREATE TABLE product_categories(
category_id serial,
category_name varchar(200) NOT NULL UNIQUE,
PRIMARY KEY(category_id)
);

CREATE TABLE suppliers(
supplier_id serial,
supplier_company_name varchar(200) NOT NULL,
supplier_phone_number varchar(20),
supplier_address varchar(200),
supplier_email varchar(200),
PRIMARY KEY(supplier_id)
);

CREATE TABLE inventory(
product_id serial,
product_name varchar(200) NOT NULL,
category_id int,
quantity int NOT NULL,
store_id int,
PRIMARY KEY(product_id),
FOREIGN KEY(category_id) REFERENCES product_categories(category_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE deliveries(
delivery_id serial,
product_id int,
supplier_id int,
store_id int,
quantity int NOT NULL,
date date NOT NULL,
PRIMARY KEY (delivery_id),
FOREIGN KEY (product_id) REFERENCES inventory(product_id),
FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE customers (
customer_id serial,
first_name varchar(30) NOT NULL,
last_name varchar(30) NOT NULL,
email varchar(200),
address varchar(200),
PRIMARY KEY (customer_id)
);

CREATE TABLE sales(
sale_id serial,
product_id int,
store_id int,
employee_id int,
quantity int NOT NULL,
date date NOT NULL,
total_price numeric(10,2) NOT NULL,
PRIMARY KEY(sale_id),
FOREIGN KEY (product_id) REFERENCES inventory(product_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id),
FOREIGN KEY (employee_id) REFERENCES employees(employee_id)
);

CREATE TABLE customer_orders (
order_id serial,
customer_id int,
store_id int,
employee_id int,
date date NOT NULL,
total_price numeric(10, 2) NOT NULL,
order_status varchar(200) NOT NULL,
PRIMARY KEY (order_id),
FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id),
FOREIGN KEY (employee_id) REFERENCES employees(employee_id)
);

CREATE TABLE order_items (
orderitem_id serial,
order_id int,
product_id int,
quantity int NOT NULL,
price numeric(10, 2) NOT NULL,
PRIMARY KEY (orderitem_id),
FOREIGN KEY (order_id) REFERENCES customer_orders(order_id),
FOREIGN KEY (product_id) REFERENCES inventory(product_id)
);

CREATE TABLE vendor_Contracts (
contract_id serial,
supplier_id int,
start_date date NOT NULL,
end_date date NOT NULL,
PRIMARY KEY (contract_id),
FOREIGN KEY (supplier_id) REFERENCES suppliers(supplier_id)
);

CREATE TABLE employee_shifts (
shift_id serial,
employee_id int,
store_id int,
shift_date date NOT NULL,
start_time time NOT NULL,
end_time time NOT NULL,
PRIMARY KEY (shift_id),
FOREIGN KEY (employee_id) REFERENCES employees(employee_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE promotions (
promotion_id serial,
product_id int,
store_id int,
start_date date NOT NULL,
end_date date NOT NULL,
discount numeric(5, 2) NOT NULL,
PRIMARY KEY (promotion_id),
FOREIGN KEY (product_id) REFERENCES inventory(product_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE accounting (
account_id serial,
account_type varchar(200) NOT NULL,
account_name varchar(200) NOT NULL,
balance numeric(15, 2) NOT NULL,
store_id int,
PRIMARY KEY (account_id),
FOREIGN KEY (store_id) REFERENCES stores(store_id)
);

CREATE TABLE transactions (
transaction_id serial,
account_id int,
transaction_type varchar(200) NOT NULL,
amount numeric(15, 2) NOT NULL,
date date NOT NULL,
description varchar(200),
PRIMARY KEY (transaction_id),
FOREIGN KEY (account_id) REFERENCES accounting(account_id)
);
"""
connection.execute(stmt)

### EMPLOYEES

In [9]:
employee_df=df1[['employee_id','first_name','last_name','role','hire_date','store_id','contact_info']]

In [10]:
employee_df.head()

,employee_id,first_name,last_name,role,hire_date,store_id,contact_info
0,222129522,Ephrem,Bastable,manager,12/16/2012,1,763-766-1766
1,478148449,Maggee,Kornyshev,sales,3/7/2011,2,331-270-8205
2,254303868,Darell,Stopps,cashier,8/1/2015,1,393-820-8772
3,349758162,Philbert,Pigden,bagger,12/13/2017,2,489-594-5172
4,358363796,Jayme,Wincer,assistant store manager,10/30/2012,1,207-163-1305

In [11]:
employee_df.to_sql(name='employees', con=engine, if_exists='append', index=False)

100

### STORES

In [12]:
stores_df = df[['store_id', 'store_address', 'phone_number', 'manager_id']].drop_duplicates()

In [13]:
stores_df.head()

     store_id       store_address  phone_number  manager_id
0           1      84-01 37th Ave  111-181-1111   222129522
496         2  31-28 Ditmars Blvd  222-232-2222   673349272

In [14]:
stores_df.to_sql(name='stores', con=engine, if_exists='append', index=False)

2

### PRODUCT CATEGORIES

In [15]:
temp_category_df1 = df.category_name.str.split(',').apply(pd.Series, 1).stack().drop_duplicates()
temp_category_df1.index = temp_category_df1.index.droplevel(-1)
temp_category_df1.name ='category_name'
id_list = [df.id[df.index == i].values[0] for i in temp_category_df1.index]
temp_category_df1 = temp_category_df1.to_frame()
temp_category_df1.insert(0, 'id', id_list)
temp_category_df1.reset_index(drop = True)
temp_category_df1.insert(0, 'category_id', range(1, 1 + len(temp_category_df1)))

temp_category_df_reduced = temp_category_df1[['category_id','category_name']]

In [16]:
temp_category_df_reduced.head()

    category_id      category_name
0             1      Chicken offal
2             2    Crumbed chicken
8             3  Beef & veal mince
14            4         Pork mince
15            5  Beef & Veal Mince

In [17]:
temp_category_df_reduced.to_sql(name ='product_categories', con = engine, if_exists = 'append', index=False)

111

### SUPPLIERS

In [18]:
temp_suppliers_df1 = df.supplier_company_name.str.split(',').apply(pd.Series, 1).stack().drop_duplicates()
temp_suppliers_df1.index = temp_suppliers_df1.index.droplevel(-1)
temp_suppliers_df1.name = 'supplier_company_name'
id_list = [df.id[df.index == i].values[0] for i in temp_suppliers_df1.index]
temp_suppliers_df1 = temp_suppliers_df1.to_frame()
temp_suppliers_df1.insert(0, 'id', id_list)
temp_suppliers_df1.reset_index(drop = True)
temp_suppliers_df1.insert(0, 'supplier_id', range(1, 1+len(temp_suppliers_df1)))

temp_suppliers_df_reduced = temp_suppliers_df1.drop_duplicates()
temp_suppliers_df_reduced1 = temp_suppliers_df_reduced.merge(df.drop_duplicates(subset=['id']), 
                                                             how='left', 
                                                             left_on='id', 
                                                             right_on='id')
maxdf=temp_suppliers_df_reduced1.merge(temp_category_df_reduced.drop_duplicates(subset=['category_name']), 
                                       how='left', 
                                       left_on='category_name', 
                                       right_on='category_name')

In [19]:
temp_suppliers_df_reduced = temp_suppliers_df_reduced1[['supplier_id',
                                                        'supplier_company_name_x', 
                                                        'supplier_phone_number',
                                                        'supplier_address',
                                                        'supplier_email']]
temp_suppliers_df_reduced = temp_suppliers_df_reduced.rename(columns={'supplier_company_name_x':'supplier_company_name'})

In [20]:
temp_suppliers_df_reduced.head()

,supplier_id,supplier_company_name,supplier_phone_number,supplier_address,supplier_email
0,1,Abshire-Bergstrom,979-514-0314,Apt 1795,dnottram1m@myspace.com
1,2,Adams,832-631-7297,PO Box 86075,bparnbyqu@ning.com
2,3,Lehner and Mraz,832-631-7297,PO Box 86075,bparnbyqu@ning.com
3,4,Altenwerth Group,864-600-4628,19th Floor,mtesseyman4@ow.ly
4,5,Altenwerth-Kilback,632-538-3809,Suite 43,eboldraql@census.gov

In [21]:
temp_suppliers_df_reduced.to_sql(name ='suppliers', con = engine, if_exists ='append', index=False)

188

### INVENTORY

In [22]:
temp_category_df3 = df.category_name.str.split(',').apply(pd.Series, 1).stack()
temp_category_df3.index = temp_category_df3.index.droplevel(-1)
temp_category_df3.name='category_name'
temp_category_df3=temp_category_df3.to_frame()
df=df.rename(columns={'customer_id':'id'})
id_list = [df.id[df.index==i].values[0] for i in temp_category_df3.index]
temp_category_df3.insert(0, 'id', id_list)
temp_category_df3.reset_index(drop=True)

        id      category_name
0        2      Chicken offal
1        4      Chicken offal
2        5    Crumbed chicken
3        6    Crumbed chicken
4        7    Crumbed chicken
...    ...                ...
1014   993  Family favourites
1015   994  Family favourites
1016   997  Family favourites
1017   999  Family favourites
1018  1000  Family favourites

[1019 rows x 2 columns]

In [23]:
temp_df = df[['product_name','supplier_company_name','quantity','store_id','id']]
temp_category_df3 = temp_category_df3.merge(temp_df.drop_duplicates(subset = ['id']), 
                                            how = 'left', 
                                            left_on = 'id', 
                                            right_on = 'id')
temp_category_df3 = temp_category_df3.merge(temp_category_df_reduced.drop_duplicates(subset = ['category_name']), 
                                            how = 'left', 
                                            left_on = 'category_name', 
                                            right_on = 'category_name')
temp_category_df3.insert(0, 'product_id', range(1, 1 + len(temp_category_df3)))

In [24]:
temp_inventory_df_reduced = temp_category_df3[['product_id','product_name','category_id','store_id','quantity']]
temp_inventory_df_reduced = temp_inventory_df_reduced.rename(columns = {'store_number':'store_id'})

In [25]:
temp_inventory_df_reduced.head()

,product_id,product_name,category_id,store_id,quantity
0,1,RSPCA Approved Chicken Livers,1,1,12
1,2,RSPCA Approved Chicken Frames,1,1,31
2,3,RSPCA Chicken Schnitzel Plain Crumb,2,1,27
3,4,RSPCA Approved Chicken Breast Kiev Garlic Butter,2,1,23
4,5,RSPCA Approved Chicken Breast Schnitzel Plain ...,2,1,30

In [26]:
temp_inventory_df_reduced.to_sql(name = 'inventory', con = engine, if_exists = 'append', index=False)

19

### DELIVERIES

In [27]:
deliveries_df = temp_suppliers_df_reduced1[['supplier_id',
                                            'product_name',
                                            'store_id',
                                            'quantity',
                                            'date_product_delivered']].drop_duplicates()

deliveries_df = deliveries_df.merge(temp_inventory_df_reduced.drop_duplicates(subset = ['product_name']), 
                                    how = 'left',
                                    left_on = 'product_name',
                                    right_on = 'product_name')

deliveries_df = deliveries_df[['product_id','supplier_id','store_id_x','quantity_x','date_product_delivered']].drop_duplicates()
deliveries_df = deliveries_df.rename(columns = {'quantity_x':'quantity',
                                                'store_id_x':'store_id',
                                                'date_product_delivered':'date'})
deliveries_df.insert(0, 'delivery_id', range(1, 1+len(deliveries_df)))

In [28]:
deliveries_df.head()

   delivery_id  product_id  supplier_id  store_id  quantity       date
0            1           1            1         1        12  3/14/2018
1            2           2            2         1        31  8/26/2015
2            3           2            3         1        31  8/26/2015
3            4           3            4         1        27  8/11/2017
4            5           4            5         1        23  10/1/2019

In [29]:
deliveries_df.to_sql(name = 'deliveries', con = engine, if_exists = 'append', index=False)

188

### CUSTOMERS

In [30]:
customers_df_reduced = df[['id','first_name', 'last_name','email','address','order_status',
                           'employee_id','date_product_delivered','Sales','store_id']].drop_duplicates()

customers_df_reduced.insert(0, 'customer_id', range(1, 1 + len(customers_df_reduced)))
customers_df = customers_df_reduced[['customer_id','first_name', 'last_name','email','address']].drop_duplicates()

In [31]:
customers_df.head()

   customer_id first_name    last_name                       email     address
0            1      Kiley   O' Donohoe    kodonohoe1@posterous.com  11th Floor
1            2     Isidro        Pavie        ipavie3@netvibes.com   Room 1187
2            3      Wendy       Errowe   werrowe4@surveymonkey.com     Apt 855
3            4    Herrick  Fairweather  hfairweather5@engadget.com    Room 283
4            5      Piggy         Amer              pamer6@ucoz.ru   Room 1223

In [32]:
customers_df.to_sql(name = 'customers', con = engine, if_exists = 'append', index=False)

1000

### SALES

In [33]:
sales_df = df.merge(temp_category_df3.drop_duplicates(subset = ['id']), how = 'left',left_on = 'id',right_on = 'id')
sales_df_reduced = sales_df[['product_name_y', 'store_id_y','quantity_y', 'date_product_delivered', 
                             'Sales','employee_id']].drop_duplicates()

sales_df_reduced = sales_df_reduced.rename(columns = {'product_name_y':'product_name',
                                                      'quantity_y':'quantity','date_product_delivered':'date',
                                                      'Sales':'total_price'})
sales_df_reduced = temp_inventory_df_reduced.merge(sales_df_reduced.drop_duplicates(subset = ['product_name']), 
                                                   how = 'left',left_on = 'product_name',right_on = 'product_name')

sales_df_reduced = sales_df_reduced.rename(columns = {'store_id_y':'store_id','quantity_y':'quantity'})
sales_df = sales_df_reduced[['product_id','store_id','employee_id','quantity','date','total_price']]
sales_df.insert(0, 'sale_id', range(1, 1 + len(sales_df)))

In [34]:
sales_df.head()

,sale_id,product_id,store_id,store_id,employee_id,quantity,date,total_price
0,1,1,1,1,222129522,12,3/14/2018,749
1,2,2,1,1,26397856,31,8/26/2015,896
2,3,3,1,1,336959121,27,8/11/2017,2355
3,4,4,1,1,329045084,23,10/1/2019,2305
4,5,5,1,1,93539360,30,7/30/2019,826

In [35]:
sales_df.to_sql(name = 'sales', con = engine, if_exists = 'append', index=False)

19

### CUSTOMER ORDERS

In [36]:
customer_orders_df = customers_df_reduced.rename(columns = {'date_product_delivered':'date',
                                                            'Sales':'total_price','store_number':'store_id'})

customer_orders_df = customer_orders_df[['customer_id', 'store_id','date', 'total_price', 'order_status']].drop_duplicates()
customer_orders_df.insert(0, 'order_id', range(1, 1 + len(customer_orders_df)))

In [37]:
customer_orders_df.head()

   order_id  customer_id  store_id       date  total_price order_status
0         1            1         1  3/14/2018          749        Delay
1         2            2         1  8/26/2015          896   Processing
2         3            3         1  8/11/2017         2355   Processing
3         4            4         1  10/1/2019         2305    Fulfilled
4         5            5         1  7/30/2019          826    Fulfilled

In [38]:
customer_orders_df.to_sql(name = 'customer_orders', con = engine, if_exists = 'append', index=False)

1000

### ORDER ITEMS

In [39]:
order_items_df = temp_category_df3.merge(customers_df_reduced.drop_duplicates(subset = ['id']), 
                                         how = 'left',left_on = 'id',right_on = 'id')

order_items_df = order_items_df.merge(customer_orders_df.drop_duplicates(subset = ['customer_id']), 
                                      how = 'left',left_on = 'customer_id',right_on = 'customer_id')

order_items_df = order_items_df.rename(columns = {'total_price':'price'})
order_items_df_reduced = order_items_df[['order_id', 'product_id','quantity', 'price']].drop_duplicates()
order_items_df_reduced.insert(0, 'orderitem_id', range(1, 1 + len(order_items_df_reduced)))

In [40]:
order_items_df_reduced.head()

   orderitem_id  order_id  product_id  quantity  price
0             1         1           1        12    749
1             2         2           2        31    896
2             3         3           3        27   2355
3             4         4           4        23   2305
4             5         5           5        30    826

In [41]:
order_items_df_reduced.to_sql(name = 'order_items', con=engine, if_exists = 'append', index=False)

19

### VENDOR CONTRACTS

In [42]:
vendor_contracts_df = temp_suppliers_df_reduced1[['supplier_id', 'start_date','end_date']].drop_duplicates()
vendor_contracts_df.insert(0, 'contract_id', range(1, 1 + len(vendor_contracts_df)))

In [43]:
vendor_contracts_df.head()

   contract_id  supplier_id  start_date    end_date
0            1            1    6/1/2017    4/6/2020
1            2            2  12/12/2013  10/30/2020
2            3            3  12/12/2013  10/30/2020
3            4            4   3/12/2015  12/24/2020
4            5            5    9/2/2017   4/19/2020

In [44]:
vendor_contracts_df.to_sql(name = 'vendor_Contracts', con = engine, if_exists = 'append', index=False)

188

### EMPLOYEE SHIFTS

In [45]:
employee_shifts_df = df1[['employee_id', 'store_id','shift_date', 'start_time', 'end_time']].drop_duplicates()
employee_shifts_df.insert(0, 'shift_id', range(1, 1 + len(employee_shifts_df)))

In [46]:
employee_shifts_df.head()

   shift_id  employee_id  store_id  shift_date start_time end_time
0         1    222129522         1  12/11/2017      08:24    18:56
1         2    478148449         2  11/10/2017      08:47    18:04
2         3    254303868         1   2/13/2016      08:35    18:57
3         4    349758162         2  10/24/2022      08:50    18:58
4         5    358363796         1   3/11/2016      08:16    18:44

In [47]:
employee_shifts_df.to_sql(name = 'employee_shifts', con = engine, if_exists = 'append', index=False)

100

### PROMOTIONS

In [48]:
promotions_df = temp_category_df3.merge(df.drop_duplicates(subset = ['id']), how = 'left',left_on = 'id',right_on = 'id')
promotions_df = promotions_df.rename(columns = {'store_id_x':'store_id','Discount':'discount','store_id_y':'store_id'})
promotions_df_reduced = promotions_df[['product_id', 'store_id','start_date', 'end_date', 'discount']].drop_duplicates()
promotions_df_reduced.insert(0, 'promotion_id', range(1, 1 + len(promotions_df)))

In [49]:
promotions_df_reduced.head()

,promotion_id,product_id,store_id,store_id,start_date,end_date,discount
0,1,1,1,1,6/1/2017,4/6/2020,0.18
1,2,2,1,1,12/12/2013,10/30/2020,0.25
2,3,3,1,1,3/12/2015,12/24/2020,0.26
3,4,4,1,1,9/2/2017,4/19/2020,0.26
4,5,5,1,1,12/24/2017,5/15/2020,0.33

In [50]:
promotions_df_reduced.to_sql(name = 'promotions', con = engine, if_exists = 'append', index=False)

19

### ACCOUNTING

In [51]:
accounting_df = df[['id','account_type', 'account_name', 'balance', 'store_id']].drop_duplicates()
accounting_df.insert(0, 'account_id', range(1, 1 + len(accounting_df)))
accounting_df_reduced = accounting_df[['account_id','account_type', 'account_name', 'balance', 'store_id']]

In [52]:
accounting_df_reduced.head()

   account_id account_type        account_name     balance  store_id
0           1    Checkings  City National Bank  1083329.37         1
1           2       Credit          Chase Bank  3564455.87         1
2           3       Credit          Chase Bank  3564455.87         1
3           4       Credit          Chase Bank  3564455.87         1
4           5       Credit          Chase Bank  3564455.87         1

In [53]:
accounting_df_reduced.to_sql(name = 'accounting', con = engine, if_exists = 'append', index=False)

1000

### TRANSACTIONS

In [54]:
transactions_df = df.rename(columns = {'date_product_delivered':'date','Sales':'amount'})
transactions_df = transactions_df[[ 'id','transaction_type', 'amount', 'date', 'description']].drop_duplicates()
transactions_df = transactions_df.merge(accounting_df.drop_duplicates(subset = ['id']), 
                                        how = 'left',left_on = 'id',right_on = 'id')

transactions_df_reduced = transactions_df[[ 'account_id','transaction_type', 'amount', 'date', 'description']]
transactions_df_reduced.insert(0, 'transaction_id', range(1, 1 + len(transactions_df_reduced)))

In [55]:
transactions_df_reduced.head()

,transaction_id,account_id,transaction_type,amount,date,description
0,1,1,Cash,749,3/14/2018,Succesful capture!
1,2,2,Ewallet,896,8/26/2015,No comment
2,3,3,Ewallet,2355,8/11/2017,Revise books
3,4,4,Ewallet,2305,10/1/2019,Revise books
4,5,5,Ewallet,826,7/30/2019,Revise books

In [56]:
transactions_df_reduced.to_sql(name = 'transactions', con=engine, if_exists = 'append', index=False)

1000